## CI Feedback 🧐

A test triggered by this PR failed. Here is an AI-generated analysis of the failure:

<table><tr><td>

**Action:** terraform</td></tr>
<tr><td>

**Failed stage:** [Terraform Plan](https://github.com/ravilushqa/homelab/actions/runs/22225962551/job/64292591404) [❌]

</td></tr>
<tr><td>

**Failed test name:** ""


</td></tr>
<tr><td>

**Failure summary:**

The action failed during the Terraform run because multiple input variables were provided with the <br>wrong type via environment variables:<br> - <code>var.externalservices_prometheus_basicauth_username</code> (declared <br>in <code>variables.tf</code> line 69) was set from <code>TF_VAR_externalservices_prometheus_basicauth_username</code>, but <br>Terraform reports <code>a number is required</code>.<br> - <code>var.externalservices_loki_basicauth_username</code> (declared in <br><code>variables.tf</code> line 81) was set from <code>TF_VAR_externalservices_loki_basicauth_username</code>, but Terraform <br>reports <code>a number is required</code>.<br> - Additional similar “Invalid value for input variable” errors <br>continue (starting at <code>variables.tf</code> line 93), indicating more variables with type mismatches.<br> <br>Terraform aborted with exit code 1 (<code>Terraform exited with code 1</code>), causing the GitHub Action step to <br>fail.<br>

</td></tr>
<tr><td>

<details><summary>Relevant error logs:</summary>


```yaml
1:  Runner name: 'komodo-runner'
2:  Runner group name: 'Default'
...

495:  + bridge      = "vmbr0"
496:  + enabled     = true
497:  + firewall    = false
498:  + mac_address = (known after apply)
499:  + model       = "virtio"
500:  + mtu         = 0
501:  + queues      = 0
502:  + rate_limit  = 0
503:  + vlan_id     = 0
504:  }
505:  + operating_system {
506:  + type = "l26"
507:  }
508:  + vga (known after apply)
509:  }
510:  Error: Invalid value for input variable
511:  on variables.tf line 69:
512:  69: variable "externalservices_prometheus_basicauth_username" {
513:  Unsuitable value for var.externalservices_prometheus_basicauth_username set
514:  using the TF_VAR_externalservices_prometheus_basicauth_username environment
515:  variable: a number is required.
516:  Error: Invalid value for input variable
517:  on variables.tf line 81:
518:  81: variable "externalservices_loki_basicauth_username" {
519:  Unsuitable value for var.externalservices_loki_basicauth_username set using
520:  the TF_VAR_externalservices_loki_basicauth_username environment variable: a
521:  number is required.
522:  Error: Invalid value for input variable
523:  on variables.tf line 93:
...

623:  + model       = "virtio"
624:  + mtu         = 0
625:  + queues      = 0
626:  + rate_limit  = 0
627:  + vlan_id     = 0
628:  }
629:  + operating_system {
630:  + type = "l26"
631:  }
632:  + vga (known after apply)
633:  }
634:  # module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin will be created
635:  + resource "helm_release" "proxmox_csi_plugin" {
636:  + atomic                     = false
637:  + chart                      = "proxmox-csi-plugin"
638:  + cleanup_on_fail            = false
639:  + create_namespace           = true
...

737:  }
738:  }
739:  # module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token will be created
740:  + resource "proxmox_virtual_environment_user_token" "kubernetes-csi-token" {
741:  + comment               = "Token for Proxmox CSI Plugin"
742:  + id                    = (known after apply)
743:  + privileges_separation = false
744:  + token_name            = "csi"
745:  + user_id               = "kubernetes-csi@pve"
746:  + value                 = (sensitive value)
747:  }
748:  # module.sealed-secrets.helm_release.sealed_secrets will be created
749:  + resource "helm_release" "sealed_secrets" {
750:  + atomic                     = false
751:  + chart                      = "sealed-secrets"
752:  + cleanup_on_fail            = false
753:  + create_namespace           = true
...

1282:  + private_key_pem               = (sensitive value)
1283:  + private_key_pem_pkcs8         = (sensitive value)
1284:  + public_key_fingerprint_md5    = (known after apply)
1285:  + public_key_fingerprint_sha256 = (known after apply)
1286:  + public_key_openssh            = (known after apply)
1287:  + public_key_pem                = (known after apply)
1288:  + rsa_bits                      = 2048
1289:  }
1290:  Plan: 24 to add, 0 to change, 0 to destroy.
1291:  Changes to Outputs:
1292:  + kubeconfig_content            = (sensitive value)
1293:  + talosconfig                   = (sensitive value)
1294:  + traefik_container_password    = (sensitive value)
1295:  + traefik_container_private_key = (sensitive value)
1296:  + traefik_container_public_key  = (known after apply)
1297:  ##[error]Terraform exited with code 1.
1298:  ##[error]Process completed with exit code 1.
1299:  ##[group]Run actions/github-script@v7
...

1564:            + rate_limit  = 0
1565:            + vlan_id     = 0
1566:          }
1567:  
1568:        + operating_system {
1569:            + type = "l26"
1570:          }
1571:  
1572:        + vga (known after apply)
1573:      }
1574:  
1575:    # module.proxmox_csi_plugin.helm_release.proxmox_csi_plugin will be created
1576:    + resource "helm_release" "proxmox_csi_plugin" {
1577:        + atomic                     = false
1578:        + chart                      = "proxmox-csi-plugin"
1579:        + cleanup_on_fail            = false
1580:        + create_namespace           = true
...

1687:  
1688:    # module.proxmox_csi_plugin.proxmox_virtual_environment_user_token.kubernetes-csi-token will be created
1689:    + resource "proxmox_virtual_environment_user_token" "kubernetes-csi-token" {
1690:        + comment               = "Token for Proxmox CSI Plugin"
1691:        + id                    = (known after apply)
1692:        + privileges_separation = false
1693:        + token_name            = "csi"
1694:        + user_id               = "kubernetes-csi@pve"
1695:        + value                 = (sensitive value)
1696:      }
1697:  
1698:    # module.sealed-secrets.helm_release.sealed_secrets will be created
1699:    + resource "helm_release" "sealed_secrets" {
1700:        + atomic                     = false
1701:        + chart                      = "sealed-secrets"
1702:        + cleanup_on_fail            = false
1703:        + create_namespace           = true

```
</details></td></tr></table>